Autodesk.Navisworks.Api.FileInteractiveResolvingEventArgs
Event arguments used for the Application::FileInteractiveResolving event

Autodesk.Navisworks.Api.FileInteractiveResolvingEventArgs.DisplayString
Get string to display to the end user explaining what sort of file is being resolved

Autodesk.Navisworks.Api.FileInteractiveResolvingEventArgs.Handled
Set whether event handler has handled interactive file resolution.
If set to true, default interactive file resolution will not occur.

Autodesk.Navisworks.Api.FileInteractiveResolvingEventArgs.ResolvedFileReference
Set file reference that Autodesk.Navisworks.Api.FileResolutionEventArgs.FileReference has been resolved to by interactively
asking user. Leave as null if file can’t be resolved.

Autodesk.Navisworks.Api.FileInteractiveResolvingEventArgs.Response
Set user's response from interactive dialog.